# เจาะลึก String (ตอนที่ 2)

##################################################################################
# การต่อ String หรือ Concatiname โดยใช้ +
fname = "John"
lname = "Tik"
age = "35"
salary = 35000.52941636314

# เอาสามตัวนี้้มาต่อกัน
fullname = fname + lname + age
print(fullname)

print("ชื่อต้น : "+fname+"\tนามสกุล : "+lname+"\tอายุ : "+age)
##################################################################################

##################################################################################
# การจัดรูปแบบการแสดงผล => การจัด format => {}
# 2f คือเอาทศนิยม 2 ตำแหน่ง
text = "ชื่อต้น : {0}\tนามสกุล : {1}\tอายุ : {2}\อาชึพ : {3}\tเงินเดือน : {4:.2f}"
print(text.format(fname, lname, age, "Data Analyst and Programmer", salary))
##################################################################################

##################################################################################
# การนับจำนวนคำในประโยค
fruit = "ไปซื้อผลไม้ มีทุเรียน มังคุด ข้าวเหนียวทุเรียน ที่ตลาด และแวะไปสวนทุเรียนด้วย"

# ค้นหาคำว่าทุเรียนว่ามีกี่จุด
print(fruit.count("ทุเรียน"))
##################################################################################

##################################################################################
# การเช็คคำขึ้นต้น
name = "นายกอไก้ ใจดี"

# อยากจะเช็คว่าประโยคที่ส่งไปขึ้นต้นด้วยคำว่านายหรือเปล่า
print(name.startswith("นาย"))

if name.startswith("นาย"):
    print("เป็นเพศชายนะครัช")
else:
    print("เป็นบุคคลอื่น")
##################################################################################

##################################################################################
# เช็คคำลงท้าย
number_car = "234785"

if number_car.endswith("0"):
    print("ถูกหวย")
else:
    print("ไม่ถูกหวย")
##################################################################################
