### Assignment 9 : แม่สูตรคูณ

##################################################################################
## แสดงแม่สูตรคูณ 2,3,4,5......
    # 2*1 ..... 2*12, 3*1.... 3*12, .........

# แสดงแม่สูตรคูณ แม่ 2,3
start = int(input("ป้อนแม่สูตรคูณเริ่มต้น = "))
stop = int(input("ป้อนแม่สูตรคูณสุดท้าย = "))

for x in range(start,stop+1):
    print("แม่สูตรคูณของเลข ",x)
    for y in range(1,12+1):
        print(x,"x",y ," = ",(x*y))
##################################################################################