### Break / Continue # ทำงานร่วมกับ loop

##################################################################################
# break ใช้ในการหยุดการทำซ้ำ

i = 1

while i<=10: #รอบที่ 4 , 5 
    print("รอบที่ = ",i)
    if (i==5):
        break # มันจะเบรครอบที่ 5
    i+=1 
# else:

print("จบโปรแกรม")

##################################################################################


##################################################################################
# contimue ใช้ในการกระโดดข้าม , ต้องเพิ่มค่าก่อนค่อยทำการเช็คค่า และเซ็ตค่าเริ่มต้นให้เป็น 0
j = 0

while j< 10: #รอบที่ 4 , 5  # ต้องแก้ตั้งแต่ตรงนี้
    # ถ้า i มันเป็นรอบที่ 10 รอบที่ 11 มันจะติดมาทำไงดีวะ
    # มันก็จะเกินมา รอบที่ 11 มันเกิดจากการบวกเพิ่มก่อนที่เราจะแสดงผลไงล่ะ
    j+=1 #4 ไปเช็ค พอเป็น 5 มันจะกระโดดข้ามไป
    if (j==5):
        continue # มันจะเบรครอบที่ 5
    print("รอบที่ = ",j)
# else:

print("จบโปรแกรม")


# ถ้าเป็นเลขคี่ให้มันกระโดดข้าม
k = 0

while k<=10: #รอบที่ 4 , 5 
    # ถ้า i มันเป็นรอบที่ 10 รอบที่ 11 มันจะติดมาทำไงดีวะ
    # มันก็จะเกินมา รอบที่ 11 มันเกิดจากการบวกเพิ่มก่อนที่เราจะแสดงผลไงล่ะ
    k+=1 #4 ไปเช็ค พอเป็น 5 มันจะกระโดดข้ามไป
    if (k%2 != 0):
        continue # มันจะเบรครอบที่ 5
    print("รอบที่ = ",k)

print("จบโปรแกรม")


# ถ้าเป็นเลขคู่ให้มันกระโดดข้าม
l = 0

while l< 10: #รอบที่ 4 , 5 
    # ถ้า i มันเป็นรอบที่ 10 รอบที่ 11 มันจะติดมาทำไงดีวะ
    # มันก็จะเกินมา รอบที่ 11 มันเกิดจากการบวกเพิ่มก่อนที่เราจะแสดงผลไงล่ะ
    l+=1 #4 ไปเช็ค พอเป็น 5 มันจะกระโดดข้ามไป
    if (l%2 == 0):
        continue # มันจะเบรครอบที่ 5
    print("รอบที่ = ",l)

print("จบโปรแกรม")
##################################################################################

##################################################################################
### การใช้กับ loop for
for i in range(1,10+1):
    if (i%2 == 0):
        continue
    print(i)
print("จบโปรแกรม")

### อยู่ที่ว่าเราจะให้มันแสดงผลก่อนจบหรือเปล่า
for i in range(1,10+1):
    print(i)
    if (i==5):
        break
    
print("จบโปรแกรม")
##################################################################################