### Assignment 13 : สร้างภาพวาดสี่เหลี่ยมจตุรัส

##################################################################################
'''
อยากจะให้แสดงผลเป็น 

3*3
xxx
xxx
xxx

2*2
xx
xx

5*5
xxxxx
xxxxx
xxxxx
xxxxx
xxxxx

'''

# loop while ใช้กรณีไม่รู้ัขนาดที่ชัดเจน

# loop for เรารู้ขนาดที่ชัดเจน

number = int(input("ป้อนขนาด = "))

for row in range(1,number+1) :
    for column in range(number+1) :
        print("X",end="")
    print(" ") # ให้ขึ้นบรรทัดใหม่ เมื่อมันวนลูปแล้ว

'''
X
XX
XXXX
'''

##################################################################################