### Assignment 14 : สร้างตารางหมากฮอต

##################################################################################
'''
ทำตาราง 3*3 ก่อน

xxx
xxx
xxx

x = สีน้ำตาล
o = สีขาว
'''

number = int(input("ป้อนขนาด = "))

for row in range(1,number+1) :
    for column in range(number+1) :
        # if (row+column)%2 == 0 :
        #     print("X",end="")
        # else :
        #     print("O",end="")
    # print(" ") # ให้ขึ้นบรรทัดใหม่ เมื่อมันวนลูปแล้ว
    # เขียนแบบ ternary
        print("X",end="") if (row+column)%2 == 0 else print("O",end="")

    print(" ") # ให้ขึ้นบรรทัดใหม่ เมื่อมันวนลูปแล้ว

##################################################################################