# function input
# รับค่าผ่านทางคีย์บอร์ดและเก็บเข้าไปในตัวแปร

# input("กรุณาป้อนชื่อของท่าน: ")

# name = input("กรุณาป้อนชื่อของท่าน: ") # รับคำที่ผู้ใช้ป้อนแล้วเก็บลงตัวแปร name
# print("คุณพิมพ์คำว่า = " + name)
# print(type(name))

# fname = input("กรุณาป้อนชื่อของท่าน : ") # รับคำที่ผู้ใช้ป้อนแล้วเก็บลงตัวแปร name
# lname = input("กรุณาป้อนนามสกุลของท่าน : ")
# print("ชื่อของคุณ = " + fname)
# print("นามสกุลของคุณ = " + lname)


##########################################################################
# x = input("ป้อนตัวเลขตัวที่ 1 : ") # รับคำที่ผู้ใช้ป้อนแล้วเก็บลงตัวแปร name
# y = input("ป้อนตัวเลขตัวที่ 2 : ")
x = int(input("ป้อนตัวเลขตัวที่ 1 : ")) # รับคำที่ผู้ใช้ป้อนแล้วเก็บลงตัวแปร name
y = int(input("ป้อนตัวเลขตัวที่ 2 : "))

# process
# z = int(x) + int(y)
# z = x + y

# output
# print(z)

# process & output
print(x + y)
##########################################################################