# ตัวดำเนินการทางคณิตศาสตร์

# ตัวดำเนินการ & ตัวที่ถูกดำเนินการ
# operator | operand

# A + B
# A , B => Operand
# + => Operator

####################################
x = 5
y = 10

print("ผลบวกเท่ากับ ", x + y)
####################################

print("ผลลบเท่ากับ ", x - y)

####################################

print("ผลคูณเท่ากับ ", x * y)

####################################

print('ผลหารเท่ากับ ', x/y)

print('ผลหารปัดเศษเท่ากับ ', x//y)

####################################

print('ยกกำลังเท่ากับ ', 5**3)

print('ยกกำลังเท่ากับ ', x**y)

####################################

print('การหารเอาเศษเท่ากับ ', x % y)
