# ตัวดำเนินการเปรียบเทียบ

# นำข้อมูลอย่างน้อย 2 ค่ามาเปรียบเทียบกัน
# ต้องเป็นข้อมูลชนิดเดียวกัน
# คำตอบ 2 คำตอบ => จริง / เท็จ

x,y = 8,7
print("ค่า x มากกว่า y หรือไม่ ? : ", x > y)
print("ค่า x น้อยกว่า y หรือไม่ ? : ", x < y)
print("ค่า x เท่ากับ y หรือไม่ ? : ", x == y)
print("ค่า x ไม่เท่ากับ y หรือไม่ ? : ", x != y)

print("ค่า x มากกว่า หรือ เท่ากับค่า y หรือไม่ ? : ", x >= y)
print("ค่า x น้อยกว่า หรือ เท่ากับค่า y หรือไม่ ? : ", x <= y)

# เปรียบเทียบค่า 3 ค่า
a,b,c = 8,7,9
print("ค่า a มากกว่า b และ b มากกว่า c หรือไม่ ? : ", a > b > c)
print("ค่า a น้อยกว่า b และ b น้อยกว่า c หรือไม่ ? : ", a < b < c)